IDENTIFICATION DIVISION.
PROGRAM-ID.  Banking.
ENVIRONMENT DIVISION.                                            
INPUT-OUTPUT SECTION.
FILE-CONTROL.                          
    SELECT IN-FILE ASSIGN TO DISK
    ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
    FILE SECTION.
       FD IN-FILE
       LABEL RECORDS ARE STANDARD
       VALUE OF FILE-ID IS "balance.txt".
       01 BALANCE-FILE.
           05 BALANCE PIC X(9).
    WORKING-STORAGE SECTION.
    01 CURRENT-BALANCE PIC S9(9).
    01 NEW-BALANCE PIC S9(9).
    01 MUTATION PIC X(8).
    01 AMOUNT PIC 9(9).
    01 DISPLAY-BALANCE PIC z,zzz,zzz,zz9.99.
    01 MUTATION-STATUS PIC X(5).
PROCEDURE DIVISION.
    OPEN INPUT IN-FILE.
    READ IN-FILE INTO BALANCE-FILE
    END-READ.
    CLOSE IN-FILE.
    MOVE FUNCTION NUMVAL(BALANCE-FILE) TO CURRENT-BALANCE.

    ACCEPT MUTATION FROM ARGUMENT-VALUE.
    ACCEPT AMOUNT FROM ARGUMENT-VALUE.
    MOVE "true" TO MUTATION-STATUS
    MOVE FUNCTION TRIM(MUTATION TRAILING) TO MUTATION
    IF MUTATION = "deposit" THEN
       COMPUTE CURRENT-BALANCE = (CURRENT-BALANCE + AMOUNT)
       MOVE "true" TO MUTATION-STATUS
    ELSE IF MUTATION = "withdraw" THEN
       COMPUTE NEW-BALANCE = (CURRENT-BALANCE - AMOUNT)
       IF NEW-BALANCE IS GREATER THAN OR EQUAL 0 THEN
           MOVE NEW-BALANCE TO CURRENT-BALANCE
       ELSE
           MOVE "false" TO MUTATION-STATUS
       END-IF
    ELSE
       DISPLAY "illegal mutation"
       MOVE "false" TO MUTATION-STATUS
    END-IF.

    REWRITE IN-FILE
    END-REWRITE.

    MOVE CURRENT-BALANCE TO DISPLAY-BALANCE.
    DISPLAY '{ success: 'FUNCTION TRIM(MUTATION-STATUS TRAILING)', balance: "'FUNCTION TRIM(DISPLAY-BALANCE LEADING)'" }'.
    STOP RUN.
