IDENTIFICATION DIVISION.
PROGRAM-ID.  Banking.
ENVIRONMENT DIVISION.                                            
INPUT-OUTPUT SECTION.
FILE-CONTROL.                          
    SELECT BALANCE-FILE ASSIGN TO DISK
    ORGANIZATION IS INDEXED
    ACCESS MODE IS RANDOM
    RECORD KEY IS ACCOUNT.
DATA DIVISION.
    FILE SECTION.
       FD BALANCE-FILE
       LABEL RECORDS ARE STANDARD
       VALUE OF FILE-ID IS "balance.txt".
       01 BALANCE-RECORD.
           05 ACCOUNT PIC X(4).
           05 BALANCE PIC 9(9).
    WORKING-STORAGE SECTION.
       01 CURRENT-BALANCE PIC S9(9).
       01 NEW-BALANCE PIC S9(9).
       01 MUTATION PIC X(8).
       01 AMOUNT PIC 9(9).
       01 DISPLAY-BALANCE PIC z,zzz,zzz,zz9.99.
       01 MUTATION-STATUS PIC X(5).
PROCEDURE DIVISION.
    *> Read current balance from file.
    ACCEPT ACCOUNT FROM ARGUMENT-VALUE.
    OPEN I-O BALANCE-FILE
    READ BALANCE-FILE INTO BALANCE-RECORD
       INVALID KEY DISPLAY "ERROR: Invalid account number."
    END-READ.

    *> Apply mutations to current balance.
    ACCEPT MUTATION FROM ARGUMENT-VALUE.
    ACCEPT AMOUNT FROM ARGUMENT-VALUE.
    MOVE "true" TO MUTATION-STATUS.
    MOVE FUNCTION TRIM(BALANCE LEADING) TO CURRENT-BALANCE.
    MOVE FUNCTION TRIM(MUTATION TRAILING) TO MUTATION.
    IF MUTATION = "deposit" THEN
       COMPUTE CURRENT-BALANCE = (CURRENT-BALANCE + AMOUNT)
       MOVE "true" TO MUTATION-STATUS
    ELSE IF MUTATION = "withdraw" THEN
       COMPUTE NEW-BALANCE = (CURRENT-BALANCE - AMOUNT)
       IF NEW-BALANCE IS GREATER THAN OR EQUAL 0 THEN
           MOVE NEW-BALANCE TO CURRENT-BALANCE
       ELSE
           MOVE "false" TO MUTATION-STATUS
       END-IF
    ELSE
       DISPLAY "ERROR: Invalid mutation."
       MOVE "false" TO MUTATION-STATUS
    END-IF.

    *> Write new balance to file.
    MOVE CURRENT-BALANCE TO BALANCE.
    REWRITE BALANCE-RECORD
       INVALID KEY DISPLAY 'ERROR: Invalid account number.'
       NOT INVALID KEY DISPLAY 'INFO: Update successful'
    END-REWRITE.
    CLOSE BALANCE-FILE.
 
    *>  Return JSON.
    MOVE BALANCE TO DISPLAY-BALANCE.
    DISPLAY '{ "success": 'FUNCTION TRIM(MUTATION-STATUS TRAILING)', "account": "'ACCOUNT'", "balance": "'FUNCTION TRIM(DISPLAY-BALANCE LEADING)'" }'.
    STOP RUN.
