IDENTIFICATION DIVISION.
PROGRAM-ID.  Banking.
ENVIRONMENT DIVISION.                                            
INPUT-OUTPUT SECTION.
FILE-CONTROL.                          
    SELECT BALANCE-FILE ASSIGN TO DISK
    ORGANIZATION IS INDEXED
    ACCESS MODE IS RANDOM
    RECORD KEY IS ACCOUNT.
DATA DIVISION.
    FILE SECTION.
       FD BALANCE-FILE
       LABEL RECORDS ARE STANDARD
       VALUE OF FILE-ID IS "data/accounts.db".
       01 BALANCE-RECORD.
           05 ACCOUNT PIC X(4).
           05 BALANCE PIC 9(9).
    WORKING-STORAGE SECTION.
       01 CURRENT-BALANCE PIC S9(9).
       01 NEW-BALANCE PIC S9(9).
       01 MUTATION PIC X(8).
       01 AMOUNT PIC 9(9).
       01 DISPLAY-BALANCE PIC zzzzzzzzz9.99.
PROCEDURE DIVISION.
    *> Read current balance from file.
    ACCEPT ACCOUNT FROM ARGUMENT-VALUE.
    OPEN I-O BALANCE-FILE
    READ BALANCE-FILE INTO BALANCE-RECORD
       INVALID KEY
           WRITE BALANCE-RECORD
           END-WRITE
    END-READ.

    *> Apply mutations to current balance.
    ACCEPT MUTATION FROM ARGUMENT-VALUE.
    ACCEPT AMOUNT FROM ARGUMENT-VALUE.
    MOVE FUNCTION TRIM(BALANCE LEADING) TO CURRENT-BALANCE.
    MOVE FUNCTION TRIM(MUTATION TRAILING) TO MUTATION.
    IF MUTATION = "deposit" THEN
       COMPUTE CURRENT-BALANCE = (CURRENT-BALANCE + AMOUNT)
    ELSE IF MUTATION = "withdraw" THEN
       COMPUTE NEW-BALANCE = (CURRENT-BALANCE - AMOUNT)
       IF NEW-BALANCE IS GREATER THAN OR EQUAL 0 THEN
           MOVE NEW-BALANCE TO CURRENT-BALANCE
       ELSE
           CLOSE BALANCE-FILE
           DISPLAY "account is empty" UPON SYSERR
           STOP RUN 1
       END-IF
    ELSE
       CLOSE BALANCE-FILE
       DISPLAY "unknown mutation" UPON SYSERR
       STOP RUN 1
    END-IF.

    *> Write new balance to file.
    MOVE CURRENT-BALANCE TO BALANCE.
    REWRITE BALANCE-RECORD
       INVALID KEY
           CLOSE BALANCE-FILE
           DISPLAY "unknown account" UPON SYSERR
           STOP RUN 1
    END-REWRITE.
    CLOSE BALANCE-FILE.
 
    *>  Return balance.
    MOVE BALANCE TO DISPLAY-BALANCE.
    DISPLAY FUNCTION TRIM(ACCOUNT TRAILING)','FUNCTION TRIM(DISPLAY-BALANCE LEADING).
    STOP RUN.
